jQuery.extend(jQuery.validator.messages, {
	required : "این فیلد لازم است.",
	remote : "لطفا ایراد این فیلد را برطرف نمایید.",
	email : "لطفا یک ایمیل معتبر وارد نمایید",
	url : "لطفا یک آدرس معتبر وارد نمایید",
	date : "لطفا یک تاریخ معتبر وارد نمایید",
	dateISO : "لطفا یک تاریخ (ایزو) معتبر وارد نمایید",
	number : "لطفا یک شماره صحیح معتبر وارد نمایید",
	digits : "لطفا فقط اعداد را وارد نمایید",
	creditcard : "لطفا یک شماره کارت معتبر وارد نمایید",
	equalTo : "لطفا مقدار برابر با قبلی را وارد نمایید",
	maxlength : $.validator.format("لطفا بیشتر از {0} عدد کارکتر وارد نکنید"),
	minlength : $.validator.format("لطفا کمتر از {0} عدد کارکتر وارد نکنید"),
	rangelength : $.validator.format("لطفا یک مقدار بین {0} و {1} کارکتر وارد نمایید"),
	range : $.validator.format("لطفا یک مقدار بین {0} و {1} وارد نمایید"),
	max : $.validator.format("لطفا یک مقدار کمتر یا مساوی {0} وارد نمایید‌"),
	min : $.validator.format("لطفا یک مقدار بیشتر یا مساوی {0} وارد نمایید‌")
});